blog/2021/ssh-unprotected-private-key-file.html
<!DOCTYPE html>
<html lang="zh">
<head>
<!-- 2022-02-08 Tue 17:00 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title><code>WARNING: UNPROTECTED PRIVATE KEY FILE!</code> 警告怎样解释</title>
<meta name="generator" content="Org mode">
<link rel="stylesheet" href="https://cdn.jsdelivr.net/gh/highlightjs/cdn-release@11.4.0/build/styles/base16/dracula.min.css">
<link rel="stylesheet" href="/theme/site.css"/>
</head>
<body>
<div id="content">
<header>
<h1 class="title"><code>WARNING: UNPROTECTED PRIVATE KEY FILE!</code> 警告怎样解释</h1>
</header><ul class="org-ul">
<li><a href="https://chmodcommand.com/">https://chmodcommand.com/</a></li>
<li><a href="https://www.howtogeek.com/168119/fixing-warning-unprotected-private-key-file-on-linux/">Fixing “WARNING: UNPROTECTED PRIVATE KEY FILE!” on Linux</a></li>
</ul>

<p>
这说明公匙和私匙的权限不对。
</p>

<p>
要对公匙和私匙设置 600 权限：
</p>

<div class="org-src-container">
<pre class="src src-sh">sudo chmod 600 ~/.ssh/yourkey
sudo chmod 600 ~/.ssh/yourkey.pub
</pre>
</div>

<p>
如果遇到：
</p>

<div class="org-src-container">
<pre class="src src-sh">Are you sure you want to continue connecting (yes/no)? yes
Failed to add the host to the list of known hosts (/home/user/.ssh/known_hosts).
</pre>
</div>

<p>
说明 <code>/home/user/.ssh/known_hosts</code> 的权限不正确，需要修改为 644：
</p>

<div class="org-src-container">
<pre class="src src-sh">sudo chmod 644 ~/.ssh/known_hosts
</pre>
</div>

<p>
最后，可能还需要调整目录的权限为 755：
</p>

<div class="org-src-container">
<pre class="src src-sh">sudo chmod 755 ~/.ssh
</pre>
</div>

<ul class="org-ul">
<li>600：表示 Ower 可读可写不可执行，Group 和 Others 都不可读不可写不可执行。</li>
<li>644：表示 Ower 可读可写不可执行，Group 和 Others 都可读不可写不可执行。</li>
<li>755：表示 Ower 可读可写可执行，Group 和 Others 都可读不可写可执行。</li>
</ul>
</div>
</body>
</html>